---
kind: type
id: T:Autodesk.Revit.UI.Events.CanExecuteEventArgs
source: html/077b9ce9-f06b-8522-3967-746be8776f3a.htm
---
# Autodesk.Revit.UI.Events.CanExecuteEventArgs

The event arguments used by AddInCommandBinding's CanExecute event.

## Syntax (C#)
```csharp
public class CanExecuteEventArgs : CommandEventArgs
```